window.onload = function(){

  var EventTitles =[
    "학생설계전공 신청",
    "분할납부 등록기간-2차",
    "개천절(공휴일)",
    "융합전공 신청",
    "한글날(공휴일)",
    "제2학기 중간고사",
    "제2학기 개강",
    "조기졸업/부전공 신청",
    "분할납부 등록기간-1차",
    "정기 고·연전",
    "수강신청 정정 및 확인",
    "2학기 최종등록기간",
    "추석(공휴일)",
    "복수전공 신청",
    "학생설계전공 신청",
    "분할납부 등록기간-2차",
    "개천절(공휴일)",
    // !-------- 구현 안됨 --------! 현재 구현 : 17개 //
    "융합전공 신청",
    "한글날(공휴일)",
    "제2학기 중간고사",
    "분할납부 등록기간-3차",
    "이중전공 신청",
    "분할납부 등록기간-최종",
    "재입학신청",
    "제2학기 기말고사",
    "겨울방학 시작, 겨울계절수업 개강",
    "성탄절(공휴일)",
    "신정(공휴일)",
    "제1학기 정의장학금(면학 및 미래로) 신청",
    "겨울계절수업 종강",
    "설날(공휴일)",
    "휴·복학 신청",
    "2020학년도 제1학기 수강희망과목 등록(재입학생 포함)",
    "2020학년도 제1학기 수강신청(재입학생 포함)",
    "2020학년도 제1학기 등록",
    "2019학년도 전기 학위수여식",
    "신입·편입생(외국인전형) 수강신청",
    "2020학년도 입학식(예정)"
  ]

  var eventDescription = [ //총 29개
    "기간 : 2019-10-01 ~ 2019-10-31 ",
    "기간 : 2019-10-01 ~ 2019-10-04 ",
    "기간 : 2019-10-03 ~ 2019-10-03 ",
    "기간 : 2019-10-08 ~ 2019-10-11 ",
    "기간 : 2019-10-09 ~ 2019-10-09 ",
    "기간 : 2019-10-21 ~ 2019-10-25 ",
    "기간 : 2019-09-02 ~ 2019-09-02 ",
    "기간 : 2019-09-02 ~ 2019-09-20 ",
    "기간 : 2019-09-02 ~ 2019-09-04 ",
    "기간 : 2019-09-06 ~ 2019-09-07 ",
    "기간 : 2019-09-08 ~ 2019-09-11 ",
    "기간 : 2019-09-10 ~ 2019-09-17 ",
    "기간 : 2019-09-12 ~ 2019-09-14 ",
    "기간 : 2019-09-18 ~ 2019-09-20 ",
    "기간 : 2019-10-01 ~ 2019-10-31 ",
    "기간 : 2019-10-01 ~ 2019-10-04 ",
    "기간 : 2019-10-03 ~ 2019-10-03 ",
    // !! ----------------------- 구현 안됨 ----------------------- !!//
    "기간 : 2019-10-08 ~ 2019-10-11 ", "기간 : 2019-10-09 ~ 2019-10-09 ", "기간 : 2019-10-21 ~ 2019-10-25 ", "기간 : 2019-11-01 ~ 2019-11-05 ",
    "기간 : 2019-11-06 ~ 2019-11-08 ", "기간 : 2019-12-02 ~ 2019-12-04 ", "기간 : 2019-12-04 ~ 2019-12-06 ", "기간 : 2019-12-16 ~ 2019-12-20 ",
    "기간 : 2019-12-23 ~ 2019-12-23 ", "기간 : 2019-12-25 ~ 2019-12-25 ", "기간 : 2020-01-01 ~ 2020-01-01 ", "기간 : 2020-01-02 ~ 2020-01-31 ",
    "기간 : 2020-01-17 ~ 2020-01-17 ", "기간 : 2020-01-24 ~ 2020-01-26 ", "기간 : 2020-02-03 ~ 2020-02-25 ", "기간 : 2020-02-04 ~ 2020-02-07 ",
    "기간 : 2020-02-18 ~ 2020-02-21 ", "기간 : 2020-02-24 ~ 2020-02-28 ", "기간 : 2020-02-25 ~ 2020-02-25 ", "기간 : 2020-02-26 ~ 2020-02-27 ",
    "기간 : 2020-02-28 ~ 2020-02-28 "
  ]

  var eventIndex = [30, 30, 32, 37, 38, 50, 1, 1, 1, 5, 7,
                    9, 11, 17, 30, 30, 32]

  cnt = 17;
  var i;
  for(i = 0; i < cnt; i++ )
  {
    if(eventIndex[i] > 40){
      continue;
    }

    var elementT = document.createElement('div');
    elementT.className = "event";
    console.log(elementT);

    var element1 = document.createElement('div');
    element1.className = "event-desc";
    element1.innerHTML = EventTitles[i];
    console.log(element1);

    var element2 = document.createElement('div');
    element2.className = "event-time";
    element2.innerHTML = eventDescription[i];
    console.log(element2);

    elementT.append(element1);
    elementT.append(element2);

    console.log("final",elementT);

    var select = document.getElementsByClassName("day");

    elementT.classList.add("KU-schedule")

    select[eventIndex[i]].appendChild(elementT);
  }
  // your JS here


  //elementT.setAttribute("style", "display:none");



  //select[2].appendChild(elementT);
  //select[2].appendChild(elementT);
  //select[2].appendChild(elementT);
}
